[
  {
    "title": "Learning from less: SINDy Surrogates in RL",
    "pub_link": "https://pureportal.coventry.ac.uk/en/publications/learning-from-less-sindy-surrogates-in-rl/",
    "authors": [
      "Aniket Dixit",
      "Muhammad Ibrahim Khan",
      "Faizan Ahmed",
      "James Brusey"
    ],
    "author_profiles": [
      "https://pureportal.coventry.ac.uk/en/persons/aniket-dixit/",
      "https://pureportal.coventry.ac.uk/en/persons/muhammad-ibrahim-khan/",
      "https://pureportal.coventry.ac.uk/en/persons/faizan-ahmed/",
      "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
    ],
    "year": "26 Apr 2025",
    "abstract": "This paper presents a method to create simpler versions of reinforcement learning (RL) environments using the Sparse Identification of Nonlinear Dynamics (SINDy) algorithm. The method was tested in OpenAI Gym's Mountain Car and Lunar Lander environments. Results show that these SINDy-based models can closely match the real environment's behavior while cutting down computational cost by 20–35%. With just 75 data points for Mountain Car and 1000 for Lunar Lander, the models achieved over 0.997 state-wise correlation, with very low prediction errors (as low as 3.11 × 10⁻⁶ for Mountain Car velocity and 1.42 × 10⁻⁶ for Lunar Lander position). RL agents trained in these simplified environments needed fewer steps to learn (65,075 vs. 100,000 for Mountain Car and 801,000 vs. 1,000,000 for Lunar Lander) and performed similarly to those trained in the full environments. This work offers a fast and accurate way to create interpretable models for use in model-based RL.",
    "doi": "https://doi.org/10.48550/arXiv.2504.18113",
    "pdf_link": "",
    "keywords": "Reinforcement Learning (RL) Model Based Learning Non Linear Dynamics",
    "fingerprints": "",
    "content": "learning from less sindy surrogates in rl aniket dixit muhammad ibrahim khan faizan ahmed james brusey 26 apr 2025 this paper presents a method to create simpler versions of reinforcement learning rl environments using the sparse identification of nonlinear dynamics sindy algorithm the method was tested in openai gym s mountain car and lunar lander environments results show that these sindy based models can closely match the real environment s behavior while cutting down computational cost by 20 35 with just 75 data points for mountain car and 1000 for lunar lander the models achieved over 0 997 state wise correlation with very low prediction errors as low as 3 11 10 ⁶ for mountain car velocity and 1 42 10 ⁶ for lunar lander position rl agents trained in these simplified environments needed fewer steps to learn 65 075 vs 100 000 for mountain car and 801 000 vs 1 000 000 for lunar lander and performed similarly to those trained in the full environments this work offers a fast and accurate way to create interpretable models for use in model based rl reinforcement learning rl model based learning non linear dynamics"
  },
  {
    "title": "Sustainable future? Building and life-style assessment",
    "pub_link": "https://pureportal.coventry.ac.uk/en/publications/sustainable-future-building-and-life-style-assessment/",
    "authors": [
      "E. I. Gaura",
      "J. Brusey",
      "J. Halloran",
      "R. Wilkins",
      "R. Rednic"
    ],
    "author_profiles": [
      "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
    ],
    "year": "1 Dec 2012",
    "abstract": "Energy, both in terms of its production and its usage has occupied a prime place in research as well as politics and world economy for the past few years. The majority of nations are aiming to deliver severe carbon cuts in the next few years. However, achieving a carbon-free future needs more than infrastructure investment and novel efficient technologies for buildings, transportation and other large consumer domains. It needs a better understanding of people as consumers, as well as a better understanding of energy waste across the multitude of socio-techical systems around us. With regards to the built environment and particularly residential buildings, the authors propose that dual, quantitative and qualitative approaches to characterising, assessing and improving occupied buildings are necessary. Such approaches would synchronously cater for understanding i) buildings technical performance (fabric and building heating, cooling and ventilation systems) and ii) occupant's motivation, ability, knowledge and efficacy for adopting low carbon lifestyles. When deployed at scale, the above will enable cost effective, targeted interventions for both building fabric and systems improvement and towards empowering their occupants to live sustainably. The paper describes such a quantitative and qualitative approach and proposes assessment tools. Further, the authors comment on the potential benefits from monitoring campaigns when deployed at scale.",
    "doi": "",
    "pdf_link": "",
    "keywords": "air pollution control building management systems buildings (structures) human factors sustainable development building assessment buildings technical performance built environment carbon cuts carbon-free future cost effective interventions energy waste infrastructure investment life-style assessment low carbon lifestyles occupant ability occupant knowledge occupant motivation politics residential buildings socio-techical systems sustainable future technology efficiency transportation world economy Buildings Carbon Heating Monitoring Sensors Temperature measurement Wireless sensor networks",
    "fingerprints": "Qualitative Approach Quantitative Approach Large Consumer Technical Performance Sustainable Future Building Ventilation Building Heating System Infrastructure Investment",
    "content": "sustainable future building and life style assessment e i gaura j brusey j halloran r wilkins r rednic 1 dec 2012 energy both in terms of its production and its usage has occupied a prime place in research as well as politics and world economy for the past few years the majority of nations are aiming to deliver severe carbon cuts in the next few years however achieving a carbon free future needs more than infrastructure investment and novel efficient technologies for buildings transportation and other large consumer domains it needs a better understanding of people as consumers as well as a better understanding of energy waste across the multitude of socio techical systems around us with regards to the built environment and particularly residential buildings the authors propose that dual quantitative and qualitative approaches to characterising assessing and improving occupied buildings are necessary such approaches would synchronously cater for understanding i buildings technical performance fabric and building heating cooling and ventilation systems and ii occupant s motivation ability knowledge and efficacy for adopting low carbon lifestyles when deployed at scale the above will enable cost effective targeted interventions for both building fabric and systems improvement and towards empowering their occupants to live sustainably the paper describes such a quantitative and qualitative approach and proposes assessment tools further the authors comment on the potential benefits from monitoring campaigns when deployed at scale air pollution control building management systems buildings structures human factors sustainable development building assessment buildings technical performance built environment carbon cuts carbon free future cost effective interventions energy waste infrastructure investment life style assessment low carbon lifestyles occupant ability occupant knowledge occupant motivation politics residential buildings socio techical systems sustainable future technology efficiency transportation world economy buildings carbon heating monitoring sensors temperature measurement wireless sensor networks qualitative approach quantitative approach large consumer technical performance sustainable future building ventilation building heating system infrastructure investment"
  },
  {
    "title": "Designing communication protocols for holonic control devices using elementary nets",
    "pub_link": "https://pureportal.coventry.ac.uk/en/publications/designing-communication-protocols-for-holonic-control-devices-usi-2/",
    "authors": [
      "James Brusey",
      "D. McFarlane"
    ],
    "author_profiles": [
      "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
    ],
    "year": "2005",
    "abstract": "",
    "doi": "https://doi.org/10.1007/11537847_7",
    "pdf_link": "",
    "keywords": "holonic manufacturing systems holon elemenary net systems RFID",
    "fingerprints": "",
    "content": "designing communication protocols for holonic control devices using elementary nets james brusey d mcfarlane 2005 holonic manufacturing systems holon elemenary net systems rfid"
  }
]