[
  {
    "title": "A community‑based entropic method to identify influential nodes across multiple social networks",
    "pub_link": "https://pureportal.coventry.ac.uk/en/publications/a-communitybased-entropic-method-to-identify-influential-nodes-ac/",
    "authors": [
      "Abdorasoul Ghasemi",
      "Narges Vafaei",
      "Farnaz Sheikhi"
    ],
    "author_profiles": [
      "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/"
    ],
    "year": "",
    "abstract": "Identifying influential nodes in social networks − by determining the most effective and efficient set of primary users − is acrucial task for maximizing the spread of influence. The competitive world of social networks and the variety of servicesthey provide have persuaded users to apply for the membership of several networks. This situation makes involvement ofthe shared individuals across multiple social networks essential for the effective dissemination of information. In this paper,we introduce a community-based entropic method to identify influential nodes in multiple social networks, taking intoaccount the effect of shared users. The proposed method, titled IM2-SE, focuses on calculating a total structural entropy foreach node. This structural entropy is defined as the weighted sum of the structural entropies of the node in the networks andin the communities, it belongs to. The structural entropy of a node is based on Tsallis entropy considering both local andglobal structures of the network, and it utilizes the degree of centrality and betweenness centrality. Then, the nodes with thehighest total structural entropy are identified as the influential nodes. The empirical evaluation of the proposed method onthe real-world datasets including homogeneous and heterogeneous networks, demonstrates its superior performance to thebaseline methods. Furthermore, the impact of the shared nodes between networks in identifying the influential nodes hasbeen examined, revealing that up to 50% of the identified influential nodes are the shared nodes between specific networks.",
    "doi": "https://doi.org/10.1007/s13278-025-01441-y",
    "pdf_link": "/files/109577027/Ghasemi2025VoR_105567539.pdf",
    "content": "a community based entropic method to identify influential nodes across multiple social networks abdorasoul ghasemi narges vafaei farnaz sheikhi identifying influential nodes in social networks by determining the most effective and efficient set of primary users is acrucial task for maximizing the spread of influence the competitive world of social networks and the variety of servicesthey provide have persuaded users to apply for the membership of several networks this situation makes involvement ofthe shared individuals across multiple social networks essential for the effective dissemination of information in this paper we introduce a community based entropic method to identify influential nodes in multiple social networks taking intoaccount the effect of shared users the proposed method titled im2 se focuses on calculating a total structural entropy foreach node this structural entropy is defined as the weighted sum of the structural entropies of the node in the networks andin the communities it belongs to the structural entropy of a node is based on tsallis entropy considering both local andglobal structures of the network and it utilizes the degree of centrality and betweenness centrality then the nodes with thehighest total structural entropy are identified as the influential nodes the empirical evaluation of the proposed method onthe real world datasets including homogeneous and heterogeneous networks demonstrates its superior performance to thebaseline methods furthermore the impact of the shared nodes between networks in identifying the influential nodes hasbeen examined revealing that up to 50 of the identified influential nodes are the shared nodes between specific networks"
  },
  {
    "title": "Explainable AI Insights for Symbolic Computation: A case study on selecting the variable ordering for cylindrical algebraic decomposition",
    "pub_link": "https://pureportal.coventry.ac.uk/en/publications/explainable-ai-insights-for-symbolic-computation-a-case-study-on-/",
    "authors": [
      "Matthew England",
      "Lynn Pickering",
      "Tereso del Río",
      "Kelly Cohen"
    ],
    "author_profiles": [
      "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
    ],
    "year": "",
    "abstract": "In recent years there has been increased use of machine learning (ML) techniques within mathematics, including symbolic computation where it may be applied safely to optimise or select algorithms. This paper explores whether using explainable AI (XAI) techniques on such ML models can offer new insight for symbolic computation, inspiring new implementations within computer algebra systems that do not directly call upon AI tools. We present a case study on the use of ML to select the variable ordering for cylindrical algebraic decomposition. It has already been demonstrated that ML can make the choice well, but here we show how the SHAP tool for explainability can be used to inform new heuristics of a size and complexity similar to those human-designed heuristics currently commonly used in symbolic computation.",
    "doi": "https://doi.org/10.1016/j.jsc.2023.102276",
    "pdf_link": "/files/79258043/Published.pdf",
    "content": "explainable ai insights for symbolic computation a case study on selecting the variable ordering for cylindrical algebraic decomposition matthew england lynn pickering tereso del río kelly cohen in recent years there has been increased use of machine learning ml techniques within mathematics including symbolic computation where it may be applied safely to optimise or select algorithms this paper explores whether using explainable ai xai techniques on such ml models can offer new insight for symbolic computation inspiring new implementations within computer algebra systems that do not directly call upon ai tools we present a case study on the use of ml to select the variable ordering for cylindrical algebraic decomposition it has already been demonstrated that ml can make the choice well but here we show how the shap tool for explainability can be used to inform new heuristics of a size and complexity similar to those human designed heuristics currently commonly used in symbolic computation"
  }
]